#+TITLE: Verteilte Systeme \linebreak \small...für C++ Programmierer \hfill Threads 2
#+AUTHOR: Dr. Günter Kolousek
#+OPTIONS: H:1 toc:nil
#+LATEX_CLASS: beamer
#+LATEX_CLASS_OPTIONS: [presentation]
#+BEAMER_THEME: Execushares
#+COLUMNS: %45ITEM %10BEAMER_ENV(Env) %10BEAMER_ACT(Act) %4BEAMER_COL(Col) %8BEAMER_OPT(Opt)

#+LATEX_HEADER:\usepackage{pgfpages}
# +LATEX_HEADER:\pgfpagesuselayout{2 on 1}[a4paper,border shrink=5mm]u
# +LATEX: \mode<handout>{\setbeamercolor{background canvas}{bg=black!5}}
#+LATEX_HEADER:\usepackage{xspace}
#+LATEX: \newcommand{\cpp}{C++\xspace}
#+LATEX: \newcommand{\cppII}{C++11\xspace}

* Thread mit Wertparameter
\vspace{1em}
#+header: :exports both :results output :tangle src/valparthread.cpp :flags -std=c++1y -lpthread
#+begin_src C++
#include <iostream>  // valparthread.cpp
#include <thread>
using namespace std;

int main() {
    auto outfunc = [](string const& msg) {
        cout << "lambda " << msg << endl;
    };
    thread t{outfunc,
             "thread"};
    cout << "main thread" << endl;
    t.join();
}
#+end_src

#+RESULTS:
: main thread
: lambda thread

* Thread mit Referenzparameter
\vspace{1em}
#+header: :exports both :results output :tangle src/refparthread.cpp :flags -std=c++1y -lpthread
#+begin_src C++
#include <iostream>  // refparthread.cpp
#include <thread>
#include <functional>  // ref
using namespace std;

int main() {
    int n{};
    auto incrfunc{[](int& n) { ++n; }};
    // use std::ref, otherwise per-value!
    //   generates 'reference_wrapper'
    //      it is copyable and assignable and
    //      imitates a reference
    thread t{incrfunc, ref(n)};
    t.join();
    cout << n << endl; }
#+end_src

#+RESULTS:
: 1

Aber Achtung, wenn Speicherobjekt nicht mehr vorhanden...

* Thread ID
\vspace{1em}
#+header: :exports both :results output :tangle src/threadid.cpp :flags -std=c++1y -lpthread :main no
#+begin_src C++
#include <iostream>  // threadid.cpp
#include <thread>
using namespace std;
using namespace std::literals;
int main() {
    thread t{[]() { this_thread::sleep_for(1s); }};
    // type std::thread::id
    // comparable (<,<=,==,...) & storable in map
    cout << this_thread::get_id() << ' ';
    cout << t.get_id() << endl;
    t.join();
    thread t2;  // no hw thread associated
    cout << t2.get_id() << endl; }
#+end_src

#+RESULTS:
: 3073369856
: 3073362752
: thread::id of a non-executing thread

